Revit 2027 API
ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService Property
 The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId DuctFittingAndAccessoryPressureDropUIService { get; }
Public Shared ReadOnly Property DuctFittingAndAccessoryPressureDropUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ DuctFittingAndAccessoryPressureDropUIService {
	ExternalServiceId^ get ();
}
static member DuctFittingAndAccessoryPressureDropUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace